## SETUP

In [1]:
#import libraries
import pandas as pd
import sqlite3

In [4]:
#df = pd.DataFrame(#data here :/)

df = pd.DataFrame({'name': ['Juan', 'Victoria', 'Mary'], \
'age': [23, 34, 43], 'city': ['Miami', 'Buenos Aries', 'Santiago']})

In [5]:
df

       name  age          city
0      Juan   23         Miami
1  Victoria   34  Buenos Aries
2      Mary   43      Santiago

In [7]:
#We will sqlite3 library and create a connection
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [11]:
df.to_sql('people', cnn)

In [12]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [15]:
%sql sqlite:///jupyter_sql_tutorial.db

In [17]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aries'),
 (2, 'Mary', 43, 'Santiago')]

In [18]:
%%sql
SELECT count(*)
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(3,)]

In [19]:
%%sql
SELECT sum(age) as 'age_sum'
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(100,)]

## Parameters walkthrough

In [20]:
#create dummy dataframe
df = pd.DataFrame({'transaction_id': ['9', '8', '7', '6', '5', '4', '3'], \
                  'user_id': ['rafa', 'roy', 'kenny', 'brendan', 'jurgen', 'roy', 'roy'],\
                  'transaction_date': ['2021-12-21', '2020-12-21', '2019-12-21',\
                                       '2018-11-21', '2017-10-21', '2019-03-02', '2010-01-01'],\
                  'amount': ['10', '15', '20', '24', '25', '31', '42']})

In [21]:
df

  transaction_id  user_id transaction_date amount
0              9     rafa       2021-12-21     10
1              8      roy       2020-12-21     15
2              7    kenny       2019-12-21     20
3              6  brendan       2018-11-21     24
4              5   jurgen       2017-10-21     25
5              4      roy       2019-03-02     31
6              3      roy       2010-01-01     42

In [22]:
#We will sqlite3 library and create a connection
cnn = sqlite3.connect('dummy.db')

In [29]:
df.to_sql('managers1', cnn)

In [30]:
%reload_ext sql

In [31]:
%sql sqlite:///dummy.db

In [32]:
%%sql
SELECT *
FROM managers1

 * sqlite:///dummy.db
Done.

[(0, '9', 'rafa', '2021-12-21', '10'),
 (1, '8', 'roy', '2020-12-21', '15'),
 (2, '7', 'kenny', '2019-12-21', '20'),
 (3, '6', 'brendan', '2018-11-21', '24'),
 (4, '5', 'jurgen', '2017-10-21', '25'),
 (5, '4', 'roy', '2019-03-02', '31'),
 (6, '3', 'roy', '2010-01-01', '42')]

In [34]:
%%sql
SELECT sum(amount) as 'spend_sum'
FROM managers1

 * sqlite:///dummy.db
Done.

[(167,)]

In [35]:
%%sql
SELECT 
    user_id
    , count(*) as num_transactions
    , sum(amount) as total_amount
FROM
    managers1
WHERE
    user_id = 'roy'
    and transaction_date = '2019-03-02'

 * sqlite:///dummy.db
Done.

[('roy', 1, 31)]

## Pandas solution

Cell at the bottom is writing the correct data for one player. Next step is to clean this up.

ovechal01, ovi8

1228 * 11,

In [13]:
#import libraries
import csv
from datetime import timedelta
from dateutil.parser import parse
import pandas as pd
import sqlite3
import time

count = 0

def find_dates(player):
    d = []
    stat_handle = player
    stat_sheet = f'./data/{stat_handle}_stats.csv'
    stat_df = pd.read_csv(stat_sheet, sep= '\t', header= 0, index_col= None)
    for row in stat_df.iterrows():
        values = row[1]
        pd_date = parse(values[0])
        
        #time delta to 1 day prior, 
        #worth investigating the effect of using time delta to travel to midnight on gameday
        start_date = pd_date - timedelta(days = 1)
        time_range = (start_date, pd_date)
        #append to dates list
        #print(time_range)
        d.append(time_range)
    return d


with open('lehner_data_points.csv', 'w', encoding='utf-8') as w:
    writer = csv.writer(w, delimiter = '\t')
    point_list = []
    twitter_handle = 'robinlehner'
    tweet_sheet = f'./data/{twitter_handle}.csv'
    twitter_df = pd.read_csv(tweet_sheet, sep= '\t', header= 0, index_col= None)

    windows = []
    
    #print(find_dates('ovechal01'))
    dates = find_dates('lehnero01')
    #print(dates)
    for date in dates:
        start = date[0]
        end = date[1]
        window = (start, end)
        windows.append(window)
    for i in range(len(twitter_df)):
        tweet_time = twitter_df.loc[i, 'date time']
        tweet_time = parse(tweet_time)
        content = twitter_df.loc[i, 'content']
        #print(twitter_df.loc[i, 'date time'], twitter_df.loc[i, 'content'])
        #if row >= start and row <= end:
        for window in windows:
            start = window[0]
            end = window[1]
            if tweet_time >= start and tweet_time <= end:
                count += 1
                row = [tweet_time, content]
                writer.writerow(row)
                #print(tweet_time, content)
            
    

                
print(f'{count} points found')

82 points found